IDEA Open Model
MatSteelRUS.MaterialStrength Property
Compatible with IDEA StatiCa v 10.1
 Material strength for specific thickness of plate
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public MaterialStrengthProperty MaterialStrength { get; set; }
Public Property MaterialStrength As MaterialStrengthProperty
	Get
	Set
public:
property MaterialStrengthProperty^ MaterialStrength {
	MaterialStrengthProperty^ get ();
	void set (MaterialStrengthProperty^ value);
}
Property Value
Type: MaterialStrengthProperty
See Also
Reference
MatSteelRUS Class
IdeaRS.OpenModel.Material Namespace